--liquibase formatted sql
--changeset Mikhail Popov:insert-documents

insert into document (slug, sort_index, title, text, paragraph) values ('document-059587', 0 , 'Публичная оферта', '
<p>Интернет-магазин &laquo;BookShop&raquo;, расположенный на доменном имени
www.bookstore.ru, организационно-правовая форма, полное наименование организации, ИП), и юридическим адресом&nbsp; юридический адрес,
в лице&nbsp; должность уполномоченного лица, ФИО,&nbsp; действующего (- ей) на основании&nbsp; указать документ, удостоверяющий полномочия и его реквизиты,
именуемое в дальнейшем &laquo;Продавец&raquo;, публикует Публичную оферту о продаже Товара дистанционным способом.</p>
<p>&nbsp;</p>
<ol>
<li><strong> ОПРЕДЕЛЕНИЕ ТЕРМИНОВ</strong></li>
</ol>
<p><strong>&nbsp;</strong></p>
<p>1.1.&nbsp;&nbsp; Публичная оферта (далее &ndash; &laquo;Оферта&raquo;) - публичное предложение Продавца, адресованное неопределенному кругу лиц, заключить с Продавцом договор купли-продажи товара дистанционным способом (далее - &laquo;Договор&raquo;) на условиях, содержащихся в настоящей Оферте, включая все Приложения.</p>
<p>1.2.&nbsp;&nbsp; Заказ Товара на сайте Интернет-магазина &ndash; позиции указанные Покупателем из ассортимента Товара, предложенного к продаже, при оформлении заявки на приобретение Товара на сайте Интернет-магазина или через Оператора.</p>
<ol start="2">
<li><strong> ОБЩИЕ ПОЛОЖЕНИЯ</strong></li>
</ol>
<p>2.1. Заказ Покупателем Товара, размещенного на сайте Интернет-магазина означает, что Покупатель согласен со всеми условиями настоящей Оферты.</p>
<p>2.2. Администрация сайта Интернет-магазина имеет право вносить изменения в Оферту без уведомления Покупателя.</p>
<p>2.3. Срок действия Оферты не ограничен, если иное не указано на сайте Интернет-магазина.</p>
<p>2.4. Продавец предоставляет Покупателю полную и достоверную информацию о Товаре, включая информацию об основных потребительских свойствах Товара, месте изготовления, а также информацию о гарантийном сроке и сроке годности Товара на сайте Интернет магазина, в разделе&nbsp; название раздела.</p>
<ol start="3">
<li><strong> ЦЕНА ТОВАРА </strong></li>
</ol>
<p>3.1. Цена на каждую позицию Товара указана на сайте Интернет-магазина.</p>
<p>3.2. Продавец имеет право в одностороннем порядке изменить цену на любую позицию Товара.</p>
<p>3.3. В случае изменения цены на заказанный Товар Продавец обязуется в течение&nbsp; количество дней проинформировать Покупателя об изменении цены Товара.</p>
<p>3.4. Покупатель вправе подтвердить либо аннулировать Заказ на приобретение Товара, если цена изменена Продавцом после оформления Заказа.</p>
<p>3.5. Изменение Продавцом цены на оплаченный Покупателем Товар не допускается.</p>
<p>3.6. Продавец указывает стоимость доставки Товара на сайте Интернет-магазина либо сообщает Покупателю при оформлении заказа Оператором.</p>
<p>3.7. Обязательства Покупателя по оплате Товара считаются исполненными с момента поступления Продавцом денежных средств.</p>
<p>3.8. Расчеты между Продавцом и Покупателем за Товар производятся способами, указанными на сайте Интернет-магазина в разделе&nbsp; название раздела</p>
<ol start="4">
<li><strong> ОФОРМЛЕНИЕ ЗАКАЗА </strong></li>
</ol>
<p>4.1. Заказ Товара осуществляется Покупателем через Оператора по телефону&nbsp; номер телефона или через сервис сайта Интернет-магазина www.bookstore.ru. 4.2. При регистрации на сайте Интернет-магазина Покупатель обязуется предоставить следующую регистрационную информацию:</p>
<p>4.2.1. имя Покупателя или указанного им лица (получателя);</p>
<p>4.2.2. адрес электронной почты;</p>
<p>4.2.3. контактный телефон.</p>
<p>4.3. Наименование, количество, ассортимент, артикул, цена выбранного Покупателем Товара указываются в корзине Покупателя на сайте Интернет-магазина.</p>
<p>4.4. Если Продавцу необходима дополнительная информация, он вправе запросить ее у Покупателя. В случае не предоставления необходимой информации Покупателем, Продавец не несет ответственности за выбранный Покупателем Товар.</p>
<p>4.5. При оформлении Заказа через Оператора (п. 4.1. настоящей Оферты) Покупатель обязуется предоставить информацию, указанную в п. 4.2. настоящей Оферты.</p>
<p>4.6. Принятие Покупателем условий настоящей Оферты осуществляется посредством внесения Покупателем соответствующих данных в регистрационную форму на сайте Интернет-магазина или при оформлении Заказа через Оператора. После оформления Заказа через Оператора данные о Покупателе регистрируются в базе данных Продавца. Утвердив Заказ выбранного Товара, Покупатель предоставляет Оператору необходимую информацию в соответствии с порядком, указанном в п. 4.2. настоящей Оферты.</p>
<p>4.7. Продавец не несет ответственности за содержание и достоверность информации, предоставленной Покупателем при оформлении Заказа.</p>
<p>4.8. Покупатель несет ответственность за достоверность предоставленной информации при оформлении Заказа.</p>
<p>4.9. Договор купли-продажи дистанционным способом между Продавцом и Покупателем считается заключенным с момента выдачи Продавцом Покупателю кассового или товарного чека либо иного документа, подтверждающего оплату Товара.</p>
<ol start="5">
<li><strong> ДОСТАВКА И ПЕРЕДАЧА ТОВАРА ПОКУПАТЕЛЮ</strong></li>
</ol>
<p>5.1. Продавец оказывает Покупателю услуги по доставке Товара одним из способов указанных на сайте Интернет-магазина.</p>
<p>5.2. Если Договор купли-продажи товара дистанционным способом (далее &ndash; Договор) заключен с условием о доставке Товара Покупателю, Продавец обязан в установленный Договором срок доставить Товар в место, указанное Покупателем, а если место доставки Товара Покупателем не указано, то по месту его жительства или регистрации.</p>
<p>5.3. Место доставки Товара Покупатель указывает при оформлении Заказа на приобретение Товара.</p>
<p>5.4. Срок доставки Товара Покупателю состоит из срока обработки заказа и срока доставки.</p>
<p>5.5. Доставленный Товар передается Покупателю, а при отсутствии Покупателя - любому лицу, предъявившему квитанцию или иной документ, подтверждающий заключение Договора или оформление доставки Товара.</p>
<p>5.6. В момент передачи Товара в обязательном порядке в письменной форме Покупателю сообщаются сведения, предусмотренные в Приложении №&nbsp; номер к Договору.</p>
<p>5.7. Информация о Товаре доводится до сведения Покупателя в технической документации, прилагаемой к Товару, на этикетках, путем нанесения маркировки или иным способом, принятым для отдельных видов товаров.</p>
<p>5.8. Сведения об обязательном подтверждении соответствия Товара представляются в порядке и способами, которые установлены законодательством Российской Федерации о техническом регулировании, и включают в себя сведения о номере документа, подтверждающего такое соответствие, о сроке его действия и об организации, его выдавшей.</p></div>',
                                                                            '<p>Интернет-магазин &laquo;BookShop&raquo;, расположенный на доменном имени
                                                                            www.bookstore.ru, организационно-правовая форма, полное наименование организации, ИП), и юридическим адресом&nbsp; юридический адрес,
                                                                            в лице&nbsp; должность уполномоченного лица, ФИО,&nbsp; действующего (- ей) на основании&nbsp; указать документ, удостоверяющий полномочия и его реквизиты,
                                                                            именуемое в дальнейшем &laquo;Продавец&raquo;, публикует Публичную оферту о продаже Товара дистанционным способом.</p>');



insert into document (slug, sort_index, title, text,  paragraph) values ('document-0594522PRI', 1 , 'Политика конфиденциальности', '
<p>Настоящая Политика конфиденциальности персональных данных (далее – Политика конфиденциальности) действует в отношении всей информации, которую сайт Bookstore, (далее – Книжный ) расположенный на доменном имени bookstore.ru (а также его субдоменах), может получить о Пользователе во время использования сайта bookstore.ru (а также его субдоменов), его программ и его продуктов.</p>
<p>1. Определение терминов</p>
<p></p>
<p>1.1 В настоящей Политике конфиденциальности используются следующие термины:</p>
<p></p>
<p>1.1.1. «Администрация сайта» (далее – Администрация) – уполномоченные сотрудники на управление сайтом Bookstore, которые организуют и (или) осуществляют обработку персональных данных, а также определяет цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными.</p>
<p></p>
<p>1.1.2. «Персональные данные» - любая информация, относящаяся к прямо или косвенно определенному, или определяемому физическому лицу (субъекту персональных данных).</p>
<p></p>
<p>1.1.3. «Обработка персональных данных» - любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.</p>
<p></p>
<p>1.1.4. «Конфиденциальность персональных данных» - обязательное для соблюдения Оператором или иным получившим доступ к персональным данным лицом требование не допускать их распространения без согласия субъекта персональных данных или наличия иного законного основания.</p>
<p></p>
<p>1.1.5. «Сайт Bookstore» - это совокупность связанных между собой веб-страниц, размещенных в сети Интернет по уникальному адресу (URL): bookstore.ru, а также его субдоменах.</p>
<p></p>
<p>1.1.6. «Субдомены» - это страницы или совокупность страниц, расположенные на доменах третьего уровня, принадлежащие сайту Bookstore, а также другие временные страницы, внизу который указана контактная информация Администрации</p>
<p></p>
<p>1.1.5. «Пользователь сайта Bookstore » (далее Пользователь) – лицо, имеющее доступ к сайту Bookstore, посредством сети Интернет и использующее информацию, материалы и продукты сайта Bookstore.</p>
<p></p>
<p>1.1.7. «Cookies» — небольшой фрагмент данных, отправленный веб-сервером и хранимый на компьютере пользователя, который веб-клиент или веб-браузер каждый раз пересылает веб-серверу в HTTP-запросе при попытке открыть страницу соответствующего сайта.</p>
<p></p>
<p>1.1.8. «IP-адрес» — уникальный сетевой адрес узла в компьютерной сети, через который Пользователь получает доступ на Книжный .</p>
<p>2. Общие положения</p>
<p></p>
<p>2.1. Использование сайта Bookstore Пользователем означает согласие с настоящей Политикой конфиденциальности и условиями обработки персональных данных Пользователя.</p>
<p></p>
<p>2.2. В случае несогласия с условиями Политики конфиденциальности Пользователь должен прекратить использование сайта Bookstore .</p>
<p></p>
<p>2.3. Настоящая Политика конфиденциальности применяется к сайту Bookstore. Книжный не контролирует и не несет ответственность за сайты третьих лиц, на которые Пользователь может перейти по ссылкам, доступным на сайте Bookstore.</p>
<p></p>
<p>2.4. Администрация не проверяет достоверность персональных данных, предоставляемых Пользователем.</p>
<p>3. Предмет политики конфиденциальности</p>
<p></p>
<p>3.1. Настоящая Политика конфиденциальности устанавливает обязательства Администрации по неразглашению и обеспечению режима защиты конфиденциальности персональных данных, которые Пользователь предоставляет по запросу Администрации при регистрации на сайте Bookstore или при подписке на информационную e-mail рассылку.</p>
<p></p>
<p>3.2. Персональные данные, разрешённые к обработке в рамках настоящей Политики конфиденциальности, предоставляются Пользователем путём заполнения форм на сайте Bookstore и включают в себя следующую информацию:</p>
<p>3.2.1. фамилию, имя, отчество Пользователя;</p>
<p>3.2.2. контактный телефон Пользователя;</p>
<p>3.2.3. адрес электронной почты (e-mail)</p>
<p>3.2.4. место жительство Пользователя (при необходимости)</p>
<p>3.2.5. фотографию (при необходимости)</p>
<p></p>
<p>3.3. Книжный защищает Данные, которые автоматически передаются при посещении страниц:</p>
<p>- IP адрес;</p>
<p>- информация из cookies;</p>
<p>- информация о браузере</p>
<p>- время доступа;</p>
<p>- реферер (адрес предыдущей страницы).</p>
<p></p>
<p>3.3.1. Отключение cookies может повлечь невозможность доступа к частям сайта , требующим авторизации.</p>
<p></p>
<p>3.3.2. Книжный осуществляет сбор статистики об IP-адресах своих посетителей. Данная информация используется с целью предотвращения, выявления и решения технических проблем.</p>
<p></p>
<p>3.4. Любая иная персональная информация неоговоренная выше (история посещения, используемые браузеры, операционные системы и т.д.) подлежит надежному хранению и нераспространению, за исключением случаев, предусмотренных в п.п. 5.2. настоящей Политики конфиденциальности.</p>
<p>4. Цели сбора персональной информации пользователя</p>
<p></p>
<p>4.1. Персональные данные Пользователя Администрация может использовать в целях:</p>
<p>4.1.1. Идентификации Пользователя, зарегистрированного на сайте Bookstore для его дальнейшей авторизации.</p>
<p>4.1.2. Предоставления Пользователю доступа к персонализированным данным сайта Bookstore.</p>
<p>4.1.3. Установления с Пользователем обратной связи, включая направление уведомлений, запросов, касающихся использования сайта Bookstore, обработки запросов и заявок от Пользователя.</p>
<p>4.1.4. Определения места нахождения Пользователя для обеспечения безопасности, предотвращения мошенничества.</p>
<p>4.1.5. Подтверждения достоверности и полноты персональных данных, предоставленных Пользователем.</p>
<p>4.1.6. Создания учетной записи для использования частей сайта Bookstore, если Пользователь дал согласие на создание учетной записи.</p>
<p>4.1.7. Уведомления Пользователя по электронной почте.</p>
<p>4.1.8. Предоставления Пользователю эффективной технической поддержки при возникновении проблем, связанных с использованием сайта Bookstore.</p>
<p>4.1.9. Предоставления Пользователю с его согласия специальных предложений, новостной рассылки и иных сведений от имени сайта Bookstore.</p>
<p>5. Способы и сроки обработки персональной информации</p>
<p></p>
<p>5.1. Обработка персональных данных Пользователя осуществляется без ограничения срока, любым законным способом, в том числе в информационных системах персональных данных с использованием средств автоматизации или без использования таких средств.</p>
<p></p>
<p>5.2. Персональные данные Пользователя могут быть переданы уполномоченным органам государственной власти Российской Федерации только по основаниям и в порядке, установленным законодательством Российской Федерации.</p>
<p></p>
<p>5.3. При утрате или разглашении персональных данных Администрация вправе не информировать Пользователя об утрате или разглашении персональных данных.</p>
<p></p>
<p>5.4. Администрация принимает необходимые организационные и технические меры для защиты персональной информации Пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий третьих лиц.</p>
<p></p>
<p>5.5. Администрация совместно с Пользователем принимает все необходимые меры по предотвращению убытков или иных отрицательных последствий, вызванных утратой или разглашением персональных данных Пользователя.</p>
<p>6. Права и обязанности сторон</p>
<p></p>
<p>6.1. Пользователь вправе:</p>
<p></p>
<p>6.1.1. Принимать свободное решение о предоставлении своих персональных данных, необходимых для использования сайта Bookstore, и давать согласие на их обработку.</p>
<p></p>
<p>6.1.2. Обновить, дополнить предоставленную информацию о персональных данных в случае изменения данной информации.</p>
<p></p>
<p>6.1.3. Пользователь имеет право на получение у Администрации информации, касающейся обработки его персональных данных, если такое право не ограничено в соответствии с федеральными законами. Пользователь вправе требовать от Администрации уточнения его персональных данных, их блокирования или уничтожения в случае, если персональные данные являются неполными, устаревшими, неточными, незаконно полученными или не являются необходимыми для заявленной цели обработки, а также принимать предусмотренные законом меры по защите своих прав. Для этого достаточно уведомить Администрацию по указаному E-mail адресу.</p>
<p></p>
<p>6.2. Администрация обязана:</p>
<p></p>
<p>6.2.1. Использовать полученную информацию исключительно для целей, указанных в п. 4 настоящей Политики конфиденциальности.</p>
<p></p>
<p>6.2.2. Обеспечить хранение конфиденциальной информации в тайне, не разглашать без предварительного письменного разрешения Пользователя, а также не осуществлять продажу, обмен, опубликование, либо разглашение иными возможными способами переданных персональных данных Пользователя, за исключением п.п. 5.2. настоящей Политики Конфиденциальности.</p>
<p></p>
<p>6.2.3. Принимать меры предосторожности для защиты конфиденциальности персональных данных Пользователя согласно порядку, обычно используемого для защиты такого рода информации в существующем деловом обороте.</p>
<p></p>
<p>6.2.4. Осуществить блокирование персональных данных, относящихся к соответствующему Пользователю, с момента обращения или запроса Пользователя, или его законного представителя либо уполномоченного органа по защите прав субъектов персональных данных на период проверки, в случае выявления недостоверных персональных данных или неправомерных действий.</p>
<p>Ответственность сторон</p>
<p></p>
<p>7.1. Администрация, не исполнившая свои обязательства, несёт ответственность за убытки, понесённые Пользователем в связи с неправомерным использованием персональных данных, в соответствии с законодательством Российской Федерации, за исключением случаев, предусмотренных п.п. 5.2. и 7.2. настоящей Политики Конфиденциальности.</p>
<p></p>
<p>7.2. В случае утраты или разглашения Конфиденциальной информации Администрация не несёт ответственность, если данная конфиденциальная информация:</p>
<p>7.2.1. Стала публичным достоянием до её утраты или разглашения.</p>
<p>7.2.2. Была получена от третьей стороны до момента её получения Администрацией Ресурса.</p>
<p>7.2.3. Была разглашена с согласия Пользователя.</p>
<p></p>
<p>7.3. Пользователь несет полную ответственность за соблюдение требований законодательства РФ, в том числе законов о рекламе, о защите авторских и смежных прав, об охране товарных знаков и знаков обслуживания, но не ограничиваясь перечисленным, включая полную ответственность за содержание и форму материалов.</p>
<p></p>
<p>7.4. Пользователь признает, что ответственность за любую информацию (в том числе, но не ограничиваясь: файлы с данными, тексты и т. д.), к которой он может иметь доступ как к части сайта Bookstore, несет лицо, предоставившее такую информацию.</p>
<p></p>
<p>7.5. Пользователь соглашается, что информация, предоставленная ему как часть сайта Bookstore, может являться объектом интеллектуальной собственности, права на который защищены и принадлежат другим Пользователям, партнерам или рекламодателям, которые размещают такую информацию на сайте Bookstore.</p>
<p>Пользователь не вправе вносить изменения, передавать в аренду, передавать на условиях займа, продавать, распространять или создавать производные работы на основе такого Содержания (полностью или в части), за исключением случаев, когда такие действия были письменно прямо разрешены собственниками такого Содержания в соответствии с условиями отдельного соглашения.</p>
<p></p>
<p>7.6. В отношение текстовых материалов (статей, публикаций, находящихся в свободном публичном доступе на сайте Bookstore) допускается их распространение при условии, что будет дана ссылка на Книжный .</p>
<p></p>
<p>7.7. Администрация не несет ответственности перед Пользователем за любой убыток или ущерб, понесенный Пользователем в результате удаления, сбоя или невозможности сохранения какого-либо Содержания и иных коммуникационных данных, содержащихся на сайте Bookstore или передаваемых через него.</p>
<p>7.8. Администрация не несет ответственности за любые прямые или косвенные убытки, произошедшие из-за: использования либо невозможности использования сайта, либо отдельных сервисов; несанкционированного доступа к коммуникациям Пользователя; заявления или поведение любого третьего лица на сайте.</p>
<p>7.9. Администрация не несет ответственность за какую-либо информацию, размещенную пользователем на сайте Bookstore, включая, но не ограничиваясь: информацию, защищенную авторским правом, без прямого согласия владельца авторского права.</p>
<p>8. Разрешение споров</p>
<p>8.1. До обращения в суд с иском по спорам, возникающим из отношений между Пользователем и Администрацией, обязательным является предъявление претензии (письменного предложения или предложения в электронном виде о добровольном урегулировании спора).</p>
<p>8.2. Получатель претензии в течение 30 календарных дней со дня получения претензии, письменно или в электронном виде уведомляет заявителя претензии о результатах рассмотрения претензии.</p>
<p>8.3. При не достижении соглашения спор будет передан на рассмотрение Арбитражного суда г. Мирный.</p>
<p>8.4. К настоящей Политике конфиденциальности и отношениям между Пользователем и Администрацией применяется действующее законодательство Российской Федерации.</p>
<p>9. Дополнительные условия</p>
<p>9.1. Администрация вправе вносить изменения в настоящую Политику конфиденциальности без согласия Пользователя.</p>
<p>9.2. Новая Политика конфиденциальности вступает в силу с момента ее размещения на сайте Bookstore, если иное не предусмотрено новой редакцией Политики конфиденциальности.</p>
<p>9.3. Все предложения или вопросы касательно настоящей Политики конфиденциальности следует сообщать по адресу: rabota822@b.ru</p>
<p>9.4. Действующая Политика конфиденциальности размещена на странице по адресу http://bookstore.ru/politika.html</p>
<p>г. Мирный, ИП Попов М.Н.</p></div>', '<p>Настоящая Политика конфиденциальности персональных данных (далее – Политика конфиденциальности) действует в отношении всей информации, которую сайт Bookstore, (далее – Книжный ) расположенный на доменном имени bookstore.ru (а также его субдоменах), может получить о Пользователе во время использования сайта bookstore.ru (а также его субдоменов), его программ и его продуктов.</p>');
